/* 1) Напишіть програму, яка продемонструє роботу з масивом. Створіть масив із восьми елементів:

'455' 87.15 true undefined null 'false' [] {}
Виведіть інформацію о типі даних кожного елемента в консолі. Додайте значення 7 до кожного елементу масива і виведіть отримані значення в консолі.*/

const array = ['455', 87.15, true, undefined, null, 'false', [], {}];
for (let key in array) {
  console.log(key);
  console.log(typeof key);
}

for (let i = 0; i <= array.length; i++) {
  console.log(array[i] + 7);
}

/* 2) Напишіть програму, яка питає у користувача число і створює масив numbers з випадкових цілих чисел в діапазоні від 0 до 10, довжина якого дорівнює числу, яке ввів користувач.

Виведіть створений масив numbers в консолі.
Скопіюйте массив numbers в новий масив. Кожен третій елемент нового масиву помножте на 3.
Виведіть новостворений масив в консолі.*/

let array2 = [];
const sizeArr = prompt();
for (i = 0; i < sizeArr; i++) {
  array2.push(Math.round(Math.random() * sizeArr));
}
